content/posts/jianguo2017.md
+++
title = "jianguo2017 | Nonrigidly Foldability Analysis of Kresling Cylindrical Origami"
author = ["João Gutemberg Farias"]
draft = false
+++

The paper studies the rigid foldability of a cylindrical origami with Kresling patterns concluding that it is not rigidly foldable. DQs are used in the method that analyses the ridid foldability.


## Info {#info}

Rigid origami is seen as a fundamental model in many self-folding machines. A key issue in designing origami is the rigid/non-rigid foldability. The kinematic and foldability of Kresling origami, which is based on an origami pattern of the vertex with six creases, are studied in this paper. The movement of the singlevertex is firstly discussed. Based on the quaternion method, the loop-closure equation of the vertex with six creases is obtained. Then the multi-transformable behavior of the single vertex is investigated. Furthermore, the rigid foldability of origami patterns with multi-vertex are investigated with an improved dual quaternion method, which is based on studying the folding angle and the coordinates of all vertices. It can be found that the Kresling cylinder is not rigidly foldable.


## Notes {#notes}


### Resumo {#resumo}

The paper studies the rigid foldability of a cylindrical origami with Kresling patterns concluding that it is not rigidly foldable. DQs are used in the method that analyses the ridid foldability.
